In [21]:
#Creating Databases in MySQL

import mysql.connector
mydb = mysql.connector.connect(host="localhost",  
              user="*****",  password="*******")
print(mydb)
cursor = mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x7fe3f2e60cc0>

In [22]:
cursor.execute('SHOW DATABASES')
for database in cursor:
    print(database)

('Games2Win',)
('business',)
('dummy',)
('information_schema',)
('krish',)
('mysql',)
('performance_schema',)
('sales',)
('songs',)
('sys',)

In [23]:
# -selected database

cursor.execute('use sales')

In [24]:
#Show tables

sql= "show tables"
cursor.execute(sql)

for database in cursor:
    print(database)

('SALES',)
('customers',)
('date',)
('markets',)
('products',)
('transactions',)

In [25]:
# 

sql= "SET sql_mode=(SELECT REPLACE(@@sql_mode,'ONLY_FULL_GROUP_BY',''))"
cursor.execute(sql)
mydb.commit()

In [26]:
# Query #0: 


sql= "SELECT * FROM SALES limit 10"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('Electricalsara Stores', 'Brick & Mortar', 'Delhi NCR', 'North', 'Distribution\r', datetime.date(2017, 11, 1), 'November', 2017, 1, 245.0, 'INR\r')
('Electricalsara Stores', 'Brick & Mortar', 'Delhi NCR', 'North', 'Distribution\r', datetime.date(2017, 11, 1), 'November', 2017, 1, 245.0, 'INR\r')
('Electricalsara Stores', 'Brick & Mortar', 'Delhi NCR', 'North', 'Distribution\r', datetime.date(2017, 11, 1), 'November', 2017, 1, 245.0, 'INR\r')
('Electricalsara Stores', 'Brick & Mortar', 'Delhi NCR', 'North', 'Distribution\r', datetime.date(2017, 11, 1), 'November', 2017, 1, 245.0, 'INR\r')
('Electricalsara Stores', 'Brick & Mortar', 'Delhi NCR', 'North', 'Distribution\r', datetime.date(2017, 11, 1), 'November', 2017, 1, 245.0, 'INR\r')
('Electricalsara Stores', 'Brick & Mortar', 'Delhi NCR', 'North', 'Distribution\r', datetime.date(2017, 11, 1), 'November', 2017, 1, 245.0, 'INR\r')
('Electricalsara Stores', 'Brick & Mortar', 'Delhi NCR', 'North', 'Distribution\r', datetime.date(2017, 11, 1), 'November', 2017, 1, 245.0, 'INR\r')
('Electricalsara Stores', 'Brick & Mortar', 'Delhi NCR', 'North', 'Distribution\r', datetime.date(2017, 11, 1), 'November', 2017, 1, 245.0, 'INR\r')
('Electricalsara Stores', 'Brick & Mortar', 'Delhi NCR', 'North', 'Distribution\r', datetime.date(2017, 11, 1), 'November', 2017, 1, 245.0, 'INR\r')
('Electricalsara Stores', 'Brick & Mortar', 'Delhi NCR', 'North', 'Distribution\r', datetime.date(2017, 11, 1), 'November', 2017, 1, 245.0, 'INR\r')

In [27]:
# Query #1: Top 3 customer's_revenue   year_wise with_location


sql= "SELECT * FROM (select year, ROW_NUMBER() OVER(PARTITION BY year ORDER BY sum(sales_amount) DESC) as ABC ,custmer_name, sum(sales_amount) as revenue, markets_name from SALES group by custmer_name, year) SUB WHERE ABC<=3"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(2017, 1, 'Electricalsara Stores', 7255594.0, 'Delhi NCR')
(2017, 2, 'Logic Stores', 3220269.0, 'Mumbai')
(2017, 3, 'Surface Stores', 2025602.0, 'Ahmedabad')
(2018, 1, 'Electricalsara Stores', 23042007.0, 'Delhi NCR')
(2018, 2, 'Nixon', 11173882.0, 'Delhi NCR')
(2018, 3, 'Excel Stores', 6939012.0, 'Ahmedabad')
(2019, 1, 'Electricalsara Stores', 41858960.0, 'Delhi NCR')
(2019, 2, 'Info Stores', 24604329.0, 'Delhi NCR')
(2019, 3, 'Logic Stores', 13277560.0, 'Mumbai')
(2020, 1, 'Excel Stores', 10025361.0, 'Mumbai')
(2020, 2, 'Nixon', 1651830.0, 'Nagpur')
(2020, 3, 'Premium Stores', 1650120.0, 'Delhi NCR')

In [28]:
# Query #2: Top 3 customer's revenue  wise with month,year & location


sql= "SELECT * FROM (select year, month_name, ROW_NUMBER() OVER(PARTITION BY year, month_name ORDER BY sum(sales_amount) DESC) as ABC ,custmer_name, sum(sales_amount) as revenue, markets_name from SALES group by custmer_name, year, month_name) SUB WHERE ABC<=3 ;"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(2017, 'December', 1, 'Electricalsara Stores', 7218784.0, 'Delhi NCR')
(2017, 'December', 2, 'Logic Stores', 3154839.0, 'Mumbai')
(2017, 'December', 3, 'Surface Stores', 2025602.0, 'Ahmedabad')
(2017, 'November', 1, 'Nixon', 1664310.0, 'Delhi NCR')
(2017, 'November', 2, 'Electricalsquipo Stores', 558180.0, 'Mumbai')
(2017, 'November', 3, 'Premium Stores', 242280.0, 'Delhi NCR')
(2018, 'August', 1, 'Nixon', 6339934.0, 'Nagpur')
(2018, 'August', 2, 'Premium Stores', 1569654.0, 'Delhi NCR')
(2018, 'August', 3, 'Excel Stores', 1423148.0, 'Ahmedabad')
(2018, 'December', 1, 'Excel Stores', 24831.0, 'Ahmedabad')
(2018, 'February', 1, 'Electricalsara Stores', 4731972.0, 'Delhi NCR')
(2018, 'February', 2, 'Flawless Stores', 2301712.0, 'Mumbai')
(2018, 'February', 3, 'Electricalslytical', 2225216.0, 'Mumbai')
(2018, 'January', 1, 'Power', 41912.0, 'Nagpur')
(2018, 'January', 2, 'Epic Stores', 22661.0, 'Nagpur')
(2018, 'January', 3, 'Electricalslytical', 6603.0, 'Nagpur')
(2018, 'June', 1, 'Electricalsara Stores', 4646130.0, 'Delhi NCR')
(2018, 'June', 2, 'Excel Stores', 2633610.0, 'Ahmedabad')
(2018, 'June', 3, 'Surge Stores', 2076390.0, 'Kochi')
(2018, 'March', 1, 'Excel Stores', 764088.0, 'Ahmedabad')
(2018, 'March', 2, 'Integration Stores', 542035.0, 'Ahmedabad')
(2018, 'March', 3, 'Path', 524985.0, 'Mumbai')
(2018, 'May', 1, 'Electricalslytical', 328662.0, 'Mumbai')
(2018, 'May', 2, 'Nomad Stores', 216566.0, 'Mumbai')
(2018, 'May', 3, 'Premium Stores', 137733.0, 'Delhi NCR')
(2018, 'November', 1, 'Electricalsara Stores', 10546080.0, 'Delhi NCR')
(2018, 'November', 2, 'Electricalslytical', 1986540.0, 'Mumbai')
(2018, 'November', 3, 'Path', 121800.0, 'Mumbai')
(2018, 'October', 1, 'Nixon', 4076779.0, 'Nagpur')
(2018, 'October', 2, 'Electricalsocity', 2954176.0, 'Mumbai')
(2018, 'October', 3, 'Excel Stores', 1735411.0, 'Ahmedabad')
(2018, 'September', 1, 'Electricalsquipo Stores', 393750.0, 'Nagpur')
(2019, 'April', 1, 'Electricalsara Stores', 3511380.0, 'Delhi NCR')
(2019, 'April', 2, 'Surface Stores', 2957640.0, 'Ahmedabad')
(2019, 'April', 3, 'Excel Stores', 2287200.0, 'Ahmedabad')
(2019, 'August', 1, 'Electricalsara Stores', 6917247.0, 'Delhi NCR')
(2019, 'August', 2, 'Modular', 5567197.0, 'Nagpur')
(2019, 'August', 3, 'Electricalslytical', 4335536.0, 'Mumbai')
(2019, 'February', 1, 'Electricalsara Stores', 4388104.0, 'Delhi NCR')
(2019, 'February', 2, 'Surface Stores', 2692368.0, 'Kochi')
(2019, 'February', 3, 'Logic Stores', 1696464.0, 'Mumbai')
(2019, 'January', 1, 'Excel Stores', 8742.0, 'Ahmedabad')
(2019, 'July', 1, 'Info Stores', 22526801.0, 'Delhi NCR')
(2019, 'July', 2, 'Logic Stores', 9465695.0, 'Mumbai')
(2019, 'July', 3, 'Electricalsara Stores', 4577088.0, 'Delhi NCR')
(2019, 'June', 1, 'Path', 2005560.0, 'Mumbai')
(2019, 'June', 2, 'Logic Stores', 503550.0, 'Mumbai')
(2019, 'March', 1, 'Electricalsara Stores', 17063361.0, 'Delhi NCR')
(2019, 'March', 2, 'Atlas Stores', 2371066.0, 'Ahmedabad')
(2019, 'March', 3, 'Info Stores', 1746230.0, 'Delhi NCR')
(2019, 'May', 1, 'Premium Stores', 154411.0, 'Mumbai')
(2019, 'May', 2, 'Electricalslytical', 104780.0, 'Mumbai')
(2019, 'May', 3, 'Nomad Stores', 98890.0, 'Mumbai')
(2019, 'November', 1, 'Electricalsara Stores', 480840.0, 'Delhi NCR')
(2019, 'November', 2, 'Electricalslytical', 311520.0, 'Mumbai')
(2019, 'November', 3, 'Logic Stores', 124440.0, 'Mumbai')
(2019, 'October', 1, 'Excel Stores', 9575993.0, 'Mumbai')
(2019, 'October', 2, 'Electricalsara Stores', 4920940.0, 'Delhi NCR')
(2019, 'October', 3, 'Surface Stores', 2556632.0, 'Kochi')
(2020, 'April', 1, 'Excel Stores', 4909590.0, 'Ahmedabad')
(2020, 'April', 2, 'Premium Stores', 1650120.0, 'Delhi NCR')
(2020, 'April', 3, 'Nixon', 1588350.0, 'Nagpur')
(2020, 'January', 1, 'Path', 133176.0, 'Nagpur')
(2020, 'January', 2, 'Electricalslytical', 16368.0, 'Nagpur')
(2020, 'June', 1, 'Excel Stores', 5087220.0, 'Mumbai')
(2020, 'June', 2, 'Nomad Stores', 534600.0, 'Bhopal')
(2020, 'June', 3, 'Info Stores', 426810.0, 'Bhopal')
(2020, 'March', 1, 'Logic Stores', 372713.0, 'Mumbai')
(2020, 'May', 1, 'Electricalslytical', 588163.0, 'Mumbai')
(2020, 'May', 2, 'Excel Stores', 28551.0, 'Ahmedabad')

In [29]:
# Query #3: Top 3 customer's_sales_qty year_wise with_location


sql= "SELECT * FROM (select year, ROW_NUMBER() OVER(PARTITION BY year ORDER BY sum(sales_qty) DESC) as ABC,custmer_name, markets_name, sum(sales_qty) as SalesQuality from SALES group by year, month_name, product_type) SUB WHERE ABC<=3"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(2017, 1, 'Info Stores', 'Delhi NCR', Decimal('53041'))
(2017, 2, 'Logic Stores', 'Mumbai', Decimal('25637'))
(2017, 3, 'Excel Stores', 'Ahmedabad', Decimal('13020'))
(2018, 1, 'Atlas Stores', 'Ahmedabad', Decimal('94350'))
(2018, 2, 'Electricalsara Stores', 'Delhi NCR', Decimal('74648'))
(2018, 3, 'Logic Stores', 'Mumbai', Decimal('41076'))
(2019, 1, 'Info Stores', 'Delhi NCR', Decimal('107240'))
(2019, 2, 'Electricalslytical', 'Mumbai', Decimal('82150'))
(2019, 3, 'Info Stores', 'Delhi NCR', Decimal('69502'))
(2020, 1, 'Premium Stores', 'Delhi NCR', Decimal('34710'))
(2020, 2, 'Atlas Stores', 'Ahmedabad', Decimal('21270'))
(2020, 3, 'Nomad Stores', 'Bhopal', Decimal('9180'))

In [30]:
# Query #4: Top 3 customers sales_qty with month year wise & location


sql= "SELECT * FROM (select year,month_name, ROW_NUMBER() OVER(PARTITION BY year, month_name ORDER BY sum(sales_qty) DESC) as ABC,custmer_name, markets_name, sum(sales_qty) as SalesQuality from SALES group by year, month_name, product_type) SUB WHERE ABC<=3"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(2017, 'December', 1, 'Info Stores', 'Delhi NCR', Decimal('53041'))
(2017, 'December', 2, 'Logic Stores', 'Mumbai', Decimal('25637'))
(2017, 'November', 1, 'Excel Stores', 'Ahmedabad', Decimal('13020'))
(2017, 'November', 2, 'Electricalsara Stores', 'Delhi NCR', Decimal('1350'))
(2018, 'August', 1, 'Electricalsara Stores', 'Delhi NCR', Decimal('74648'))
(2018, 'August', 2, 'Excel Stores', 'Ahmedabad', Decimal('10261'))
(2018, 'December', 1, 'Excel Stores', 'Ahmedabad', Decimal('62'))
(2018, 'December', 2, 'Excel Stores', 'Ahmedabad', Decimal('62'))
(2018, 'February', 1, 'Logic Stores', 'Mumbai', Decimal('41076'))
(2018, 'February', 2, 'Logic Stores', 'Mumbai', Decimal('40096'))
(2018, 'January', 1, 'Epic Stores', 'Nagpur', Decimal('248'))
(2018, 'January', 2, 'Power', 'Nagpur', Decimal('124'))
(2018, 'June', 1, 'Atlas Stores', 'Ahmedabad', Decimal('94350'))
(2018, 'June', 2, 'Flawless Stores', 'Ahmedabad', Decimal('11490'))
(2018, 'March', 1, 'Logic Stores', 'Mumbai', Decimal('15531'))
(2018, 'March', 2, 'Synthetic', 'Bhopal', Decimal('6541'))
(2018, 'May', 1, 'Premium Stores', 'Delhi NCR', Decimal('1705'))
(2018, 'May', 2, 'Premium Stores', 'Delhi NCR', Decimal('1333'))
(2018, 'November', 1, 'Electricalslytical', 'Mumbai', Decimal('12300'))
(2018, 'November', 2, 'Electricalsara Stores', 'Delhi NCR', Decimal('6450'))
(2018, 'October', 1, 'Logic Stores', 'Mumbai', Decimal('20367'))
(2018, 'October', 2, 'Electricalsocity', 'Mumbai', Decimal('11346'))
(2018, 'September', 1, 'Electricalsquipo Stores', 'Nagpur', Decimal('360'))
(2019, 'April', 1, 'Electricalslytical', 'Mumbai', Decimal('64560'))
(2019, 'April', 2, 'Premium Stores', 'Delhi NCR', Decimal('17520'))
(2019, 'August', 1, 'Electricalsara Stores', 'Delhi NCR', Decimal('59272'))
(2019, 'August', 2, 'Electricalsopedia Stores', 'Nagpur', Decimal('8246'))
(2019, 'February', 1, 'Info Stores', 'Delhi NCR', Decimal('107240'))
(2019, 'February', 2, 'Sage', 'Ahmedabad', Decimal('10668'))
(2019, 'January', 1, 'Excel Stores', 'Ahmedabad', Decimal('31'))
(2019, 'July', 1, 'Logic Stores', 'Mumbai', Decimal('40827'))
(2019, 'July', 2, 'Info Stores', 'Delhi NCR', Decimal('32612'))
(2019, 'June', 1, 'Logic Stores', 'Mumbai', Decimal('3090'))
(2019, 'June', 2, 'Path', 'Mumbai', Decimal('1260'))
(2019, 'March', 1, 'Info Stores', 'Delhi NCR', Decimal('69502'))
(2019, 'March', 2, 'Info Stores', 'Delhi NCR', Decimal('14446'))
(2019, 'May', 1, 'Electricalslytical', 'Mumbai', Decimal('403'))
(2019, 'May', 2, 'Nomad Stores', 'Mumbai', Decimal('31'))
(2019, 'November', 1, 'Electricalsara Stores', 'Delhi NCR', Decimal('6000'))
(2019, 'November', 2, 'Logic Stores', 'Mumbai', Decimal('870'))
(2019, 'October', 1, 'Electricalslytical', 'Mumbai', Decimal('82150'))
(2019, 'October', 2, 'Electricalsopedia Stores', 'Nagpur', Decimal('35247'))
(2020, 'April', 1, 'Premium Stores', 'Delhi NCR', Decimal('34710'))
(2020, 'April', 2, 'Atlas Stores', 'Ahmedabad', Decimal('21270'))
(2020, 'January', 1, 'Path', 'Nagpur', Decimal('558'))
(2020, 'June', 1, 'Nomad Stores', 'Bhopal', Decimal('9180'))
(2020, 'June', 2, 'Electricalsocity', 'Mumbai', Decimal('2550'))
(2020, 'March', 1, 'Logic Stores', 'Mumbai', Decimal('1984'))
(2020, 'May', 1, 'Excel Stores', 'Ahmedabad', Decimal('558'))
(2020, 'May', 2, 'Electricalslytical', 'Mumbai', Decimal('310'))

In [31]:
# Query #5: Top 3 location revenue wise with year 


sql= "SELECT * FROM (select year, ROW_NUMBER() OVER(PARTITION BY year ORDER BY sum(sales_amount) DESC) as ABC ,markets_name, sum(sales_amount) as revenue from SALES group by markets_name, year) SUB WHERE ABC<=3"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(2017, 1, 'Delhi NCR', 9924722.0)
(2017, 2, 'Mumbai', 4803326.0)
(2017, 3, 'Ahmedabad', 4015126.0)
(2018, 1, 'Delhi NCR', 36196501.0)
(2018, 2, 'Mumbai', 14692276.0)
(2018, 3, 'Ahmedabad', 11109400.0)
(2019, 1, 'Delhi NCR', 70709958.0)
(2019, 2, 'Mumbai', 39173850.0)
(2019, 3, 'Nagpur', 20118503.0)
(2020, 1, 'Mumbai', 7020498.0)
(2020, 2, 'Ahmedabad', 6259221.0)
(2020, 3, 'Delhi NCR', 3106830.0)

In [32]:
# Query #6: Top 3 location revenue  wise with month,year 


sql= "SELECT * FROM (select year, month_name, ROW_NUMBER() OVER(PARTITION BY year, month_name ORDER BY sum(sales_amount) DESC) as ABC , markets_name, sum(sales_amount) as revenue from SALES group by markets_name, year,month_name) SUB WHERE ABC<=3"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(2017, 'December', 1, 'Delhi NCR', 7981322.0)
(2017, 'December', 2, 'Mumbai', 4103036.0)
(2017, 'December', 3, 'Ahmedabad', 3994846.0)
(2017, 'November', 1, 'Delhi NCR', 1943400.0)
(2017, 'November', 2, 'Mumbai', 700290.0)
(2017, 'November', 3, 'Kanpur', 48600.0)
(2018, 'August', 1, 'Delhi NCR', 7493940.0)
(2018, 'August', 2, 'Nagpur', 2986261.0)
(2018, 'August', 3, 'Ahmedabad', 1538809.0)
(2018, 'December', 1, 'Ahmedabad', 24831.0)
(2018, 'February', 1, 'Delhi NCR', 5517400.0)
(2018, 'February', 2, 'Mumbai', 5121256.0)
(2018, 'February', 3, 'Ahmedabad', 855148.0)
(2018, 'January', 1, 'Nagpur', 71176.0)
(2018, 'June', 1, 'Delhi NCR', 6087540.0)
(2018, 'June', 2, 'Ahmedabad', 3474180.0)
(2018, 'June', 3, 'Kochi', 2288190.0)
(2018, 'March', 1, 'Ahmedabad', 1524084.0)
(2018, 'March', 2, 'Nagpur', 1306309.0)
(2018, 'March', 3, 'Mumbai', 1236745.0)
(2018, 'May', 1, 'Mumbai', 629889.0)
(2018, 'May', 2, 'Delhi NCR', 171213.0)
(2018, 'November', 1, 'Delhi NCR', 10679970.0)
(2018, 'November', 2, 'Mumbai', 2164170.0)
(2018, 'November', 3, 'Kochi', 57510.0)
(2018, 'October', 1, 'Delhi NCR', 5364395.0)
(2018, 'October', 2, 'Ahmedabad', 3692348.0)
(2018, 'October', 3, 'Mumbai', 3645352.0)
(2018, 'September', 1, 'Nagpur', 393750.0)
(2019, 'April', 1, 'Delhi NCR', 3868200.0)
(2019, 'April', 2, 'Ahmedabad', 3090510.0)
(2019, 'April', 3, 'Kochi', 2617110.0)
(2019, 'August', 1, 'Nagpur', 7250962.0)
(2019, 'August', 2, 'Delhi NCR', 7045246.0)
(2019, 'August', 3, 'Mumbai', 3914618.0)
(2019, 'February', 1, 'Delhi NCR', 5264728.0)
(2019, 'February', 2, 'Kochi', 4358508.0)
(2019, 'February', 3, 'Mumbai', 1693356.0)
(2019, 'January', 1, 'Ahmedabad', 8742.0)
(2019, 'July', 1, 'Delhi NCR', 27491234.0)
(2019, 'July', 2, 'Mumbai', 10172836.0)
(2019, 'July', 3, 'Nagpur', 4885693.0)
(2019, 'June', 1, 'Mumbai', 2509110.0)
(2019, 'March', 1, 'Delhi NCR', 19807357.0)
(2019, 'March', 2, 'Ahmedabad', 4126751.0)
(2019, 'March', 3, 'Mumbai', 3356184.0)
(2019, 'May', 1, 'Mumbai', 348316.0)
(2019, 'May', 2, 'Nagpur', 9765.0)
(2019, 'November', 1, 'Delhi NCR', 533070.0)
(2019, 'November', 2, 'Mumbai', 435960.0)
(2019, 'October', 1, 'Mumbai', 14662070.0)
(2019, 'October', 2, 'Delhi NCR', 6700123.0)
(2019, 'October', 3, 'Nagpur', 4074082.0)
(2020, 'April', 1, 'Ahmedabad', 6230670.0)
(2020, 'April', 2, 'Delhi NCR', 3106830.0)
(2020, 'April', 3, 'Bhopal', 1142190.0)
(2020, 'January', 1, 'Nagpur', 149544.0)
(2020, 'June', 1, 'Mumbai', 5445150.0)
(2020, 'June', 2, 'Bhopal', 637380.0)
(2020, 'June', 3, 'Nagpur', 211350.0)
(2020, 'March', 1, 'Mumbai', 372713.0)
(2020, 'May', 1, 'Mumbai', 571795.0)
(2020, 'May', 2, 'Ahmedabad', 28551.0)
(2020, 'May', 3, 'Nagpur', 16368.0)

In [33]:
# Query #7: Top 3 locationr's_sales_qty year_wise 

sql= "SELECT * FROM (select year, ROW_NUMBER() OVER(PARTITION BY year ORDER BY sum(sales_qty) DESC) as ABC, markets_name, sum(sales_qty) as SalesQuality from SALES group by year, markets_name) SUB WHERE ABC<=3"
cursor.execute(sql)
myresult= cursor.fetchall()   

for x in myresult:
  print(x)

(2017, 1, 'Delhi NCR', Decimal('34000'))
(2017, 2, 'Kochi', Decimal('20956'))
(2017, 3, 'Nagpur', Decimal('10106'))
(2018, 1, 'Delhi NCR', Decimal('117321'))
(2018, 2, 'Kochi', Decimal('60664'))
(2018, 3, 'Mumbai', Decimal('59937'))
(2019, 1, 'Delhi NCR', Decimal('175824'))
(2019, 2, 'Kochi', Decimal('167111'))
(2019, 3, 'Nagpur', Decimal('97050'))
(2020, 1, 'Delhi NCR', Decimal('25890'))
(2020, 2, 'Mumbai', Decimal('17877'))
(2020, 3, 'Ahmedabad', Decimal('14014'))

In [34]:
# Query #8: Top 3 location sales_qty with month year wise

sql= "SELECT * FROM (select year,month_name, ROW_NUMBER() OVER(PARTITION BY year, month_name ORDER BY sum(sales_qty) DESC) as ABC, markets_name, sum(sales_qty) as SalesQuality from SALES group by year, month_name, markets_name) SUB WHERE ABC<=3 "
cursor.execute(sql)
myresult= cursor.fetchall()   

for x in myresult:
  print(x)

(2017, 'December', 1, 'Delhi NCR', Decimal('22630'))
(2017, 'December', 2, 'Kochi', Decimal('20956'))
(2017, 'December', 3, 'Nagpur', Decimal('10106'))
(2017, 'November', 1, 'Delhi NCR', Decimal('11370'))
(2017, 'November', 2, 'Mumbai', Decimal('2670'))
(2017, 'November', 3, 'Kanpur', Decimal('240'))
(2018, 'August', 1, 'Delhi NCR', Decimal('32550'))
(2018, 'August', 2, 'Hyderabad', Decimal('17453'))
(2018, 'August', 3, 'Nagpur', Decimal('13392'))
(2018, 'December', 1, 'Ahmedabad', Decimal('124'))
(2018, 'February', 1, 'Mumbai', Decimal('36092'))
(2018, 'February', 2, 'Delhi NCR', Decimal('26936'))
(2018, 'February', 3, 'Kochi', Decimal('7700'))
(2018, 'January', 1, 'Nagpur', Decimal('372'))
(2018, 'June', 1, 'Kochi', Decimal('41310'))
(2018, 'June', 2, 'Delhi NCR', Decimal('30780'))
(2018, 'June', 3, 'Nagpur', Decimal('10470'))
(2018, 'March', 1, 'Nagpur', Decimal('5177'))
(2018, 'March', 2, 'Hyderabad', Decimal('4557'))
(2018, 'March', 3, 'Ahmedabad', Decimal('3782'))
(2018, 'May', 1, 'Mumbai', Decimal('1829'))
(2018, 'May', 2, 'Delhi NCR', Decimal('1209'))
(2018, 'November', 1, 'Delhi NCR', Decimal('15120'))
(2018, 'November', 2, 'Mumbai', Decimal('2640'))
(2018, 'November', 3, 'Kochi', Decimal('990'))
(2018, 'October', 1, 'Delhi NCR', Decimal('8773'))
(2018, 'October', 2, 'Ahmedabad', Decimal('7719'))
(2018, 'October', 3, 'Nagpur', Decimal('5952'))
(2018, 'September', 1, 'Nagpur', Decimal('360'))
(2019, 'April', 1, 'Kochi', Decimal('52800'))
(2019, 'April', 2, 'Nagpur', Decimal('9300'))
(2019, 'April', 3, 'Delhi NCR', Decimal('7800'))
(2019, 'August', 1, 'Nagpur', Decimal('39339'))
(2019, 'August', 2, 'Delhi NCR', Decimal('12958'))
(2019, 'August', 3, 'Mumbai', Decimal('4278'))
(2019, 'February', 1, 'Kochi', Decimal('84644'))
(2019, 'February', 2, 'Delhi NCR', Decimal('19096'))
(2019, 'February', 3, 'Ahmedabad', Decimal('4872'))
(2019, 'January', 1, 'Ahmedabad', Decimal('31'))
(2019, 'July', 1, 'Delhi NCR', Decimal('40455'))
(2019, 'July', 2, 'Nagpur', Decimal('20925'))
(2019, 'July', 3, 'Mumbai', Decimal('8339'))
(2019, 'June', 1, 'Mumbai', Decimal('4350'))
(2019, 'March', 1, 'Delhi NCR', Decimal('51088'))
(2019, 'March', 2, 'Ahmedabad', Decimal('6355'))
(2019, 'March', 3, 'Nagpur', Decimal('6076'))
(2019, 'May', 1, 'Mumbai', Decimal('403'))
(2019, 'May', 2, 'Nagpur', Decimal('31'))
(2019, 'November', 1, 'Delhi NCR', Decimal('5460'))
(2019, 'November', 2, 'Mumbai', Decimal('1410'))
(2019, 'October', 1, 'Delhi NCR', Decimal('38967'))
(2019, 'October', 2, 'Mumbai', Decimal('31527'))
(2019, 'October', 3, 'Kochi', Decimal('21173'))
(2020, 'April', 1, 'Delhi NCR', Decimal('25890'))
(2020, 'April', 2, 'Ahmedabad', Decimal('13890'))
(2020, 'April', 3, 'Mumbai', Decimal('6510'))
(2020, 'January', 1, 'Nagpur', Decimal('558'))
(2020, 'June', 1, 'Mumbai', Decimal('8670'))
(2020, 'June', 2, 'Bhopal', Decimal('1530'))
(2020, 'June', 3, 'Nagpur', Decimal('960'))
(2020, 'March', 1, 'Mumbai', Decimal('1984'))
(2020, 'May', 1, 'Mumbai', Decimal('713'))
(2020, 'May', 2, 'Ahmedabad', Decimal('124'))
(2020, 'May', 3, 'Nagpur', Decimal('31'))

In [35]:
# Query #9: Top 3 products revenue wise with year 

sql= "SELECT * FROM (select year, product_type, ROW_NUMBER() OVER(PARTITION BY year ORDER BY sum(sales_amount) DESC) as ABC, sum(sales_amount) as revenue from SALES group by year, product_type) SUB WHERE ABC<=3"
cursor.execute(sql)
myresult= cursor.fetchall()   

for x in myresult:
  print(x)

(2017, 'Own Brand\r', 1, 17728053.0)
(2017, 'Distribution\r', 2, 7831703.0)
(2018, 'Own Brand\r', 1, 57090063.0)
(2018, 'Distribution\r', 2, 25271306.0)
(2019, 'Own Brand\r', 1, 111670075.0)
(2019, 'Distribution\r', 2, 47938545.0)
(2020, 'Own Brand\r', 1, 12483825.0)
(2020, 'Distribution\r', 2, 7056846.0)

In [36]:
# Query #10: Top 3 products revenue  wise with month,year 

sql= "SELECT * FROM (select year, month_name, ROW_NUMBER() OVER(PARTITION BY year,month_name ORDER BY sum(sales_amount) DESC) as ABC, product_type, sum(sales_amount) as revenue from SALES group by year, month_name, product_type) SUB WHERE ABC<=3 "
cursor.execute(sql)
myresult= cursor.fetchall()   

for x in myresult:
  print(x)

(2017, 'December', 1, 'Own Brand\r', 15329283.0)
(2017, 'December', 2, 'Distribution\r', 7517903.0)
(2017, 'November', 1, 'Own Brand\r', 2398770.0)
(2017, 'November', 2, 'Distribution\r', 313800.0)
(2018, 'August', 1, 'Own Brand\r', 11709599.0)
(2018, 'August', 2, 'Distribution\r', 3938736.0)
(2018, 'December', 1, 'Own Brand\r', 13919.0)
(2018, 'December', 2, 'Distribution\r', 10912.0)
(2018, 'February', 1, 'Own Brand\r', 8371048.0)
(2018, 'February', 2, 'Distribution\r', 5560604.0)
(2018, 'January', 1, 'Own Brand\r', 59272.0)
(2018, 'January', 2, 'Distribution\r', 11904.0)
(2018, 'June', 1, 'Own Brand\r', 14382750.0)
(2018, 'June', 2, 'Distribution\r', 2840520.0)
(2018, 'March', 1, 'Own Brand\r', 3910681.0)
(2018, 'March', 2, 'Distribution\r', 2293380.0)
(2018, 'May', 1, 'Distribution\r', 471138.0)
(2018, 'May', 2, 'Own Brand\r', 329964.0)
(2018, 'November', 1, 'Own Brand\r', 10939170.0)
(2018, 'November', 2, 'Distribution\r', 1962480.0)
(2018, 'October', 1, 'Distribution\r', 7787882.0)
(2018, 'October', 2, 'Own Brand\r', 7373660.0)
(2018, 'September', 1, 'Distribution\r', 393750.0)
(2019, 'April', 1, 'Distribution\r', 7081590.0)
(2019, 'April', 2, 'Own Brand\r', 6085770.0)
(2019, 'August', 1, 'Own Brand\r', 19180010.0)
(2019, 'August', 2, 'Distribution\r', 2743624.0)
(2019, 'February', 1, 'Own Brand\r', 14101808.0)
(2019, 'February', 2, 'Distribution\r', 1961820.0)
(2019, 'January', 1, 'Own Brand\r', 8742.0)
(2019, 'July', 1, 'Distribution\r', 24209915.0)
(2019, 'July', 2, 'Own Brand\r', 19431575.0)
(2019, 'June', 1, 'Own Brand\r', 1792320.0)
(2019, 'June', 2, 'Distribution\r', 716790.0)
(2019, 'March', 1, 'Own Brand\r', 25298139.0)
(2019, 'March', 2, 'Distribution\r', 5635583.0)
(2019, 'May', 1, 'Own Brand\r', 349897.0)
(2019, 'May', 2, 'Distribution\r', 8184.0)
(2019, 'November', 1, 'Distribution\r', 662610.0)
(2019, 'November', 2, 'Own Brand\r', 306420.0)
(2019, 'October', 1, 'Own Brand\r', 25115394.0)
(2019, 'October', 2, 'Distribution\r', 4918429.0)
(2020, 'April', 1, 'Own Brand\r', 6069390.0)
(2020, 'April', 2, 'Distribution\r', 5966220.0)
(2020, 'January', 1, 'Own Brand\r', 149544.0)
(2020, 'June', 1, 'Own Brand\r', 5751810.0)
(2020, 'June', 2, 'Distribution\r', 614280.0)
(2020, 'March', 1, 'Distribution\r', 372713.0)
(2020, 'May', 1, 'Own Brand\r', 513081.0)
(2020, 'May', 2, 'Distribution\r', 103633.0)

In [37]:
# Query #11: Top 3 products_sales_qty year_wise  

sql= "SELECT * FROM (select year, ROW_NUMBER() OVER(PARTITION BY year,product_type ORDER BY sum(sales_qty) DESC) as ABC, markets_name,product_type, sum(sales_qty) as SalesQuality from SALES group by year, product_type) SUB WHERE ABC<=3 "
cursor.execute(sql)
myresult= cursor.fetchall()   

for x in myresult:
  print(x)

(2017, 1, 'Delhi NCR', 'Distribution\r', Decimal('26987'))
(2017, 1, 'Delhi NCR', 'Own Brand\r', Decimal('66061'))
(2018, 1, 'Mumbai', 'Distribution\r', Decimal('89415'))
(2018, 1, 'Mumbai', 'Own Brand\r', Decimal('258935'))
(2019, 1, 'Delhi NCR', 'Distribution\r', Decimal('127860'))
(2019, 1, 'Delhi NCR', 'Own Brand\r', Decimal('426115'))
(2020, 1, 'Ahmedabad', 'Distribution\r', Decimal('26362'))
(2020, 1, 'Mumbai', 'Own Brand\r', Decimal('44758'))

In [38]:
# Query #12: Top 3 products sales_qty  with month year wise

sql= "SELECT * FROM (select year, month_name, ROW_NUMBER() OVER(PARTITION BY year,month_name,product_type ORDER BY sum(sales_qty) DESC) as ABC, markets_name,product_type, sum(sales_qty) as SalesQuality from SALES group by year,month_name, product_type) SUB WHERE ABC<=3"
cursor.execute(sql)
myresult= cursor.fetchall()   

for x in myresult:
  print(x)

(2017, 'December', 1, 'Mumbai', 'Distribution\r', Decimal('25637'))
(2017, 'December', 1, 'Delhi NCR', 'Own Brand\r', Decimal('53041'))
(2017, 'November', 1, 'Delhi NCR', 'Distribution\r', Decimal('1350'))
(2017, 'November', 1, 'Ahmedabad', 'Own Brand\r', Decimal('13020'))
(2018, 'August', 1, 'Ahmedabad', 'Distribution\r', Decimal('10261'))
(2018, 'August', 1, 'Delhi NCR', 'Own Brand\r', Decimal('74648'))
(2018, 'December', 1, 'Ahmedabad', 'Distribution\r', Decimal('62'))
(2018, 'December', 1, 'Ahmedabad', 'Own Brand\r', Decimal('62'))
(2018, 'February', 1, 'Mumbai', 'Distribution\r', Decimal('41076'))
(2018, 'February', 1, 'Mumbai', 'Own Brand\r', Decimal('40096'))
(2018, 'January', 1, 'Nagpur', 'Distribution\r', Decimal('124'))
(2018, 'January', 1, 'Nagpur', 'Own Brand\r', Decimal('248'))
(2018, 'June', 1, 'Ahmedabad', 'Distribution\r', Decimal('11490'))
(2018, 'June', 1, 'Ahmedabad', 'Own Brand\r', Decimal('94350'))
(2018, 'March', 1, 'Bhopal', 'Distribution\r', Decimal('6541'))
(2018, 'March', 1, 'Mumbai', 'Own Brand\r', Decimal('15531'))
(2018, 'May', 1, 'Delhi NCR', 'Distribution\r', Decimal('1705'))
(2018, 'May', 1, 'Delhi NCR', 'Own Brand\r', Decimal('1333'))
(2018, 'November', 1, 'Delhi NCR', 'Distribution\r', Decimal('6450'))
(2018, 'November', 1, 'Mumbai', 'Own Brand\r', Decimal('12300'))
(2018, 'October', 1, 'Mumbai', 'Distribution\r', Decimal('11346'))
(2018, 'October', 1, 'Mumbai', 'Own Brand\r', Decimal('20367'))
(2018, 'September', 1, 'Nagpur', 'Distribution\r', Decimal('360'))
(2019, 'April', 1, 'Delhi NCR', 'Distribution\r', Decimal('17520'))
(2019, 'April', 1, 'Mumbai', 'Own Brand\r', Decimal('64560'))
(2019, 'August', 1, 'Nagpur', 'Distribution\r', Decimal('8246'))
(2019, 'August', 1, 'Delhi NCR', 'Own Brand\r', Decimal('59272'))
(2019, 'February', 1, 'Ahmedabad', 'Distribution\r', Decimal('10668'))
(2019, 'February', 1, 'Delhi NCR', 'Own Brand\r', Decimal('107240'))
(2019, 'January', 1, 'Ahmedabad', 'Own Brand\r', Decimal('31'))
(2019, 'July', 1, 'Delhi NCR', 'Distribution\r', Decimal('32612'))
(2019, 'July', 1, 'Mumbai', 'Own Brand\r', Decimal('40827'))
(2019, 'June', 1, 'Mumbai', 'Distribution\r', Decimal('3090'))
(2019, 'June', 1, 'Mumbai', 'Own Brand\r', Decimal('1260'))
(2019, 'March', 1, 'Delhi NCR', 'Distribution\r', Decimal('14446'))
(2019, 'March', 1, 'Delhi NCR', 'Own Brand\r', Decimal('69502'))
(2019, 'May', 1, 'Mumbai', 'Distribution\r', Decimal('31'))
(2019, 'May', 1, 'Mumbai', 'Own Brand\r', Decimal('403'))
(2019, 'November', 1, 'Delhi NCR', 'Distribution\r', Decimal('6000'))
(2019, 'November', 1, 'Mumbai', 'Own Brand\r', Decimal('870'))
(2019, 'October', 1, 'Nagpur', 'Distribution\r', Decimal('35247'))
(2019, 'October', 1, 'Mumbai', 'Own Brand\r', Decimal('82150'))
(2020, 'April', 1, 'Ahmedabad', 'Distribution\r', Decimal('21270'))
(2020, 'April', 1, 'Delhi NCR', 'Own Brand\r', Decimal('34710'))
(2020, 'January', 1, 'Nagpur', 'Own Brand\r', Decimal('558'))
(2020, 'June', 1, 'Mumbai', 'Distribution\r', Decimal('2550'))
(2020, 'June', 1, 'Bhopal', 'Own Brand\r', Decimal('9180'))
(2020, 'March', 1, 'Mumbai', 'Distribution\r', Decimal('1984'))
(2020, 'May', 1, 'Ahmedabad', 'Distribution\r', Decimal('558'))
(2020, 'May', 1, 'Mumbai', 'Own Brand\r', Decimal('310'))